Rasshireniya/БазаЗнаний/Catalogs/SZ_БазаЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>SZ_БазаЗнаний</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Знание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗнаниеХЗ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТэгиТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗнаниеТабл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Тэги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тэг</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.SZ_Тэги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СодержимоеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Rasshireniya/БазаЗнаний/Catalogs/SZ_БазаЗнаний/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ХЗ  = ТекущийОбъект.ЗнаниеХЗ.Получить();
	Таб = ТекущийОбъект.ЗнаниеТабл.Получить();
	
	Если Таб.ВысотаТаблицы > 0 Тогда
		Элементы.Таблица.Заголовок = "Данные";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТекущийОбъект.ЗнаниеХЗ = Новый ХранилищеЗначения(ХЗ);
	ТекущийОбъект.Знание   = ХЗ.ПолучитьТекст();
	
	ТекущийОбъект.ЗнаниеТабл = Новый ХранилищеЗначения(Таб);
	КС                       = Таб.ВысотаТаблицы;
	КК                       = Таб.ШиринаТаблицы;
	Стр                      = "";
	
	Для НС = 1 По КС Цикл
		ТекСтр = "";
		
		Для НК = 1 По КК Цикл
			Слово = СокрЛП(Таб.Область(НС, НК, НС, НК).Текст);
			
			Если Слово <> "" Тогда
				ТекСтр = ТекСтр + " " + Слово;
			КонецЕсли;
		
		КонецЦикла;
		
		Если ТекСтр <> "" Тогда
			Стр = Стр + Символы.ПС + СокрЛП(ТекСтр);
		КонецЕсли;
	
	КонецЦикла;
	
	ТекущийОбъект.Знание = ТекущийОбъект.Знание + Символы.ПС + Стр;
КонецПроцедуры

&НаКлиенте
асинх Процедура ВыбратьФайл(Команда)
	
	ЭтаФорма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	
	ВыбФайл = ждать ПоместитьФайлНаСерверАсинх();
	
	Если ВыбФайл <> Неопределено Тогда
		ОбработатьВыборФайла(ВыбФайл, ВыбФайл.Адрес, ВыбФайл.СсылкаНаФайл.Имя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	
	КонецЕсли;
	
	СсылкаНаФайл = Адрес;
	
	Файл = Новый Файл(ВыбранноеИмяФайла);
	
	НовСтр      = Объект.Файлы.Добавить();
	НовСтр.Файл = "" + формат(Объект.Код, "ЧГ=0; ЧЦ=4; ЧВН=") + " " + Файл.Имя;
	
	НовСтр.СодержимоеФайла = ЗаписатьНаСервере(НовСтр.Файл);;
	
	ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	Записать(ПараметрыЗаписи);
	
КонецПроцедуры

&НаСервере

Функция ЗаписатьнаСервере(ИмяФайла)
	Возврат БЗ_ОбщийМодульСервер.ЗаписатьСервер(ИмяФайла, СсылкаНаФайл);

КонецФункции

&НаСервере
Процедура ПоказатьФайлСервер(ИмяФайла)
	ДД           = Новый ДвоичныеДанные(ИмяФайла);
	Адрес        = ПоместитьВоВременноеХранилище(ДД, УникальныйИдентификатор);
	СсылкаНаФайл = Адрес;
КонецПроцедуры

&НаКлиенте
Процедура ФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Имя      = Элементы.Файлы.ТекущиеДанные.файл;
	ИмяФайла = Путь + Имя;
	ПоказатьФайлСервер(ИмяФайла);
	ПолучитьФайл(СсылкаНаФайл, Имя, Истина);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элем = Справочники.УзКонстанты.НайтиПоНаименованию("ПутьБЗ");
	
	Если Элем.Пустая() Тогда
		Нов              = Справочники.УзКонстанты.СоздатьЭлемент();
		Нов.Наименование = "ПутьБЗ";
		Нов.Значение     = "C:\temp\0\";
		Нов.Записать();
		Путь = Нов.Значение;
	Иначе
		Путь = Элем.Значение;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		Элементы.ХЗ.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ХЗ.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Редактирование(Команда)

	Если Элементы.ХЗ.ТолькоПросмотр Тогда
		Элементы.ХЗ.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ХЗ.ТолькоПросмотр = Истина;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ФайлыПередУдалением(Элемент, Отказ)
	УдалитьФайлНаСервере(Элемент.ТекущиеДанные.Файл);
КонецПроцедуры

&НаСервере
Процедура УдалитьФайлНаСервере(ВыбФайл)  
	ПутьФайл = Справочники.УзКонстанты.НайтиПоНаименованию("ПутьБЗ").Значение;
	УдалитьФайлы(ПутьФайл + ВыбФайл);
КонецПроцедуры
